[{"title":"Exploration powered by structured content","id":"a72a6c41-4371-4cb9-94b6-10526c8c7cff","path":"/blog/exploration-powered-by-structured-content/","tags":["API"],"body":"Having all my blog posts as structured content and available over an API makes experimenting and exploration with new designs, frameworks, and technologies all that more fun! Now I can just connect whatever it is to my blog powered by Sanity.io, and give me some real™ content to play around with. "},{"title":"A CMS I Can use on My Phone. Finally!","id":"627ac499-68f8-4459-bb3f-c4f24886a888","path":"/blog/finally-i-found-a-content-management-system-i-can-use-on-my-phone/","tags":["Sanity Studio","responsiveness"],"body":"It's always when I'm out and about I get the message where somebody has found a spelling error in one of my blog posts. I'm so glad that somebody thought of this when they designed Sanity Studio and made it truly responsive. \n\n"},{"title":"My First Introduction to Portable Text","id":"ddaf3c38-4159-4470-9da8-33e3ead2ec9f","path":"/blog/my-first-introduction-to-portable-text/","tags":["Portable Text","JSON","Rich Text","RTE"],"body":"Portable Text is a JSON based rich text specification for modern content editing platforms. The rich text editor in Sanity Studio uses it and lets me embed data objects both inline and inbetween my text blocks. I can even have references in them so that my content backend warns me if I try to delete content that is linked to. I can also customize the editor with React components and paste-handling overrides. I can even make it speak!"},{"title":"Picture Perfect Cropping with Hotspots and stuff","id":"1a558cde-16fb-4362-8082-634468a1cc20","path":"/blog/picture-perfect-cropping-with-hotspots/","tags":["css-tricks","cropping","aspect ratio"],"body":"I’m deciding how to crop an image for any aspect ratio using the Sanity’s hotspot and cropping feature. It’s for art direction for frontends. There's a post on CSS-tricks on how to do it. You should totally check that out!"},{"title":"My brand new blog powered by Sanity.io","id":"fb5f90f7-7980-4b2a-b9da-35cd0a23829a","path":"/blog/my-brand-new-blog-powered-by-sanity-io/","tags":["podcasts","gridsome"],"body":"Welcome to my new blog!\n\nWhat just happened?\n\nI have just added a new repository to my GitHub account. There I have all the code for this blog’s frontend made with Gridsome and Sanity Studio, the environment where I will be editing my content. They are deployed on Netlify. So everything is ready for me to get started with blogging! I can even edit content and use the Netlify widget on the Studio’s dashboard to deploy new changes to the web.\n\nSanity.io lets me work with structured content. That means I can add more content types. Who knows, I might add my portfolio, maybe a podcast, some products that I need to market, or my poetry collection (that I totally have)! I can even connect other frontends to my Sanity project when I find that new framework I just need to try out. \n\nBut firstly, how could I make this blog my own special place on the internet? \n\n\n\nI should probably check out the tutorial videos on how to get started with customizing both the content schema and the frontend accordingly. I'm sure I'll find them on the dashboard in the Studio.\n\nEditing some text in fullscreen!!!\n\n\n\nThere's plenty of cool things I could explore:\n\nHow to customize content schemas\n\nHow to use structure builder to make my own workflows\n\nHow to manage widgets on my dashboard\n\nHow to turn on real-time content preview in Gridsome\n\n\n\nAnd if I get stuck, I could always seek help in the friendly developer community."}]